GopalSaraf/Practicals/PSDL/include/proc/pic18f448.inc
#define TXB2EID2                         BANKMASK(TXB2EIDL), 2, b
#define TXB2EID3                         BANKMASK(TXB2EIDL), 3, b
#define TXB2EID4                         BANKMASK(TXB2EIDL), 4, b
#define TXB2EID5                         BANKMASK(TXB2EIDL), 5, b
#define TXB2EID6                         BANKMASK(TXB2EIDL), 6, b
#define TXB2EID7                         BANKMASK(TXB2EIDL), 7, b
#define TXB2EID8                         BANKMASK(TXB2EIDH), 0, b
#define TXB2EID9                         BANKMASK(TXB2EIDH), 1, b
#define TXB2ERR                          BANKMASK(TXB2CON), 4, b
#define TXB2EXIDE                        BANKMASK(TXB2SIDL), 3, b
#define TXB2IE                           BANKMASK(PIE3), 4, a
#define TXB2IF                           BANKMASK(PIR3), 4, a
#define TXB2IP                           BANKMASK(IPR3), 4, a
#define TXB2LARB                         BANKMASK(TXB2CON), 5, b
#define TXB2PRI0                         BANKMASK(TXB2CON), 0, b
#define TXB2PRI1                         BANKMASK(TXB2CON), 1, b
#define TXB2REQ                          BANKMASK(TXB2CON), 3, b
#define TXB2RTR                          BANKMASK(TXB2DLC), 6, b
#define TXB2SID0                         BANKMASK(TXB2SIDL), 5, b
#define TXB2SID1                         BANKMASK(TXB2SIDL), 6, b
#define TXB2SID10                        BANKMASK(TXB2SIDH), 7, b
#define TXB2SID2                         BANKMASK(TXB2SIDL), 7, b
#define TXB2SID3                         BANKMASK(TXB2SIDH), 0, b
#define TXB2SID4                         BANKMASK(TXB2SIDH), 1, b
#define TXB2SID5                         BANKMASK(TXB2SIDH), 2, b
#define TXB2SID6                         BANKMASK(TXB2SIDH), 3, b
#define TXB2SID7                         BANKMASK(TXB2SIDH), 4, b
#define TXB2SID8                         BANKMASK(TXB2SIDH), 5, b
#define TXB2SID9                         BANKMASK(TXB2SIDH), 6, b
#define TXBNIE                           BANKMASK(PIE3), 4, a
#define TXBNIF                           BANKMASK(PIR3), 4, a
#define TXBNIP                           BANKMASK(IPR3), 4, a
#define TXBO                             BANKMASK(COMSTAT), 5, a
#define TXBP                             BANKMASK(COMSTAT), 4, a
#define TXD8                             BANKMASK(TXSTA), 0, a
#define TXEN                             BANKMASK(TXSTA), 5, a
#define TXEN1                            BANKMASK(TXSTA), 5, a
#define TXIE                             BANKMASK(PIE1), 4, a
#define TXIF                             BANKMASK(PIR1), 4, a
#define TXIP                             BANKMASK(IPR1), 4, a
#define TXWARN                           BANKMASK(COMSTAT), 2, a
#define UA                               BANKMASK(SSPSTAT), 1, a
#define ULPWUIN                          BANKMASK(PORTA), 0, a
#define VREFM                            BANKMASK(PORTA), 2, a
#define VREFP                            BANKMASK(PORTA), 3, a
#define WAIT0                            BANKMASK(PR2), 4, a
#define WAIT1                            BANKMASK(PR2), 5, a
#define WAKFIL                           BANKMASK(BRGCON3), 6, a
#define WAKIE                            BANKMASK(PIE3), 6, a
#define WAKIF                            BANKMASK(PIR3), 6, a
#define WAKIP                            BANKMASK(IPR3), 6, a
#define WCOL                             BANKMASK(SSPCON1), 7, a
#define WIN0                             BANKMASK(CANCON), 1, a
#define WIN1                             BANKMASK(CANCON), 2, a
#define WIN2                             BANKMASK(CANCON), 3, a
#define WM0                              BANKMASK(PR2), 0, a
#define WM1                              BANKMASK(PR2), 1, a
#define WR                               BANKMASK(EECON1), 1, a
#define WRE                              BANKMASK(PORTE), 1, a
#define WREN                             BANKMASK(EECON1), 2, a
#define WRERR                            BANKMASK(EECON1), 3, a
#define ZERO                             BANKMASK(STATUS), 2, a
#define nA                               BANKMASK(SSPSTAT), 5, a
#define nADDRESS                         BANKMASK(SSPSTAT), 5, a
#define nBOR                             BANKMASK(RCON), 0, a
#define nCS                              BANKMASK(PORTE), 2, a
#define nDONE                            BANKMASK(ADCON0), 2, a
#define nIPEN                            BANKMASK(RCON), 7, a
#define nPD                              BANKMASK(RCON), 2, a
#define nPOR                             BANKMASK(RCON), 1, a
#define nRBPU                            BANKMASK(INTCON2), 7, a
#define nRC8                             BANKMASK(RCSTA), 6, a
#define nRD                              BANKMASK(PORTE), 0, a
#define nRI                              BANKMASK(RCON), 4, a
#define nSS                              BANKMASK(PORTA), 5, a
#define nT1SYNC                          BANKMASK(T1CON), 2, a
#define nT3SYNC                          BANKMASK(T3CON), 2, a
#define nTO                              BANKMASK(RCON), 3, a
#define nTX8                             BANKMASK(TXSTA), 6, a
#define nW                               BANKMASK(SSPSTAT), 2, a
#define nWR                              BANKMASK(PORTE), 1, a
#define nWRITE                           BANKMASK(SSPSTAT), 2, a

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

#if _COMMON_SIZE_
psect udata_acs,class=COMRAM,space=SPACE_DATA,noexec,lowdata
#endif
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec,lowdata
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec,lowdata
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec,lowdata
psect udata,class=RAM,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,reloc=2
psect data,class=CONST,space=SPACE_CODE,reloc=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=1,noexec

#endif // _XC_INC_

#endif // _PIC18F448_INC_
